{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Оценка числа $\\pi$ методом Монте-Карло"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "В этом домашнем задании предлагается своими руками написать программу для оценки числа $\\pi$ в подходе объектно-ориентированного программирования.\n",
    "\n",
    "Число $\\pi$ будет оцениваться, исходя из предположения, что нам уже известна формула площади круга, вписанного в единичный квадрат. Для такого круга радиус равен 0.5, поэтому площадь вычисляется следующим образом:\n",
    "$$\n",
    "S = \\frac{\\pi}{4}\n",
    "$$\n",
    "\n",
    "Методом Монте-Карло будем оценивать площадь круга по количеству точек, лежащих внутри ограничивающей его окружности. Точки произвольно (случайно) порождаются равномерно по всей области единичного квадрата. В этом случае, если $N_{in}$ - число точек, лежащих внутри окружности, и $N$ - общее число порожденных точек, то площадь оценивается следующим образом:\n",
    "$$\n",
    "S \\approx \\frac{N_{in}}{N}\n",
    "$$\n",
    "\n",
    "Тогда число $\\pi$ оценивается как $4*\\frac{N_{in}}{N}$\n",
    "\n",
    "Принадлежность произвольной точки кругу можно определять по выполнению следующего неравенства:\n",
    "$$\n",
    "\\rho <= 0.5; \\\\\n",
    "\\rho = \\sqrt{(x-x_c)^2 + (y-y_c)^2},\n",
    "$$\n",
    "где $x_c$ и $y_c$ - координаты центра круга, то есть, $x_c=0.5; y_c=0.5$\n",
    "\n",
    "При этом будем считать, что точность оценки $\\pi$ возрастает с повышением количества порожденнных точек. Это требует доказательства, но в этом ДЗ на этом останавливаться не нужно.\n",
    "\n",
    "Точность оценки числа $\\pi$ обозначим за $\\epsilon$. Это параметр, который будет задаваться исследователем при запуске программы вычисления числа.\n",
    "\n",
    "Сценарий вычисления числа $\\pi$ в этом ДЗ подразумевает применением объектно-ориентированного программирования. То есть, для вычисления создается экземпляр класса `Approximator`, который при запуске метода `approximate` начинает итеративную процедуру оценки числа $\\pi$. Эта итеративная процедура должна быть реализована в форме цикла. Условием прерывания этого цикла должно стать снижение разницы между двумя последовательными оценками числа $\\pi$ ниже уровня $\\epsilon$. Обратите внимание, что для этого в отдельной переменной следует хранить предыдущее значение оценки числа $\\pi$ - чтобы было с чем сравнивать. Начальное значение для этой переменной можно задать равным 10.\n",
    "\n",
    "При этом обратите внимание на то, что параметр точности оценки ($\\epsilon$) задается при создании экземпляра класса `Approximator` и запоминается в виде его атрибута `eps`.\n",
    "\n",
    "Результат оценки числа $\\pi$ выдается экземпляром класса `Approximator` в качестве возвращаемого значения.\n",
    "\n",
    "Ниже приведен шаблон класса `Approximator` и процедура применения этого класса для оценки числа $\\pi$\n",
    "\n",
    "В вашу задачу входит вписать недостающие участки кода этого класса.\n",
    "\n",
    "ВНИМАНИЕ! В описании класса `Approximator` должна присутствовать проверка типа передаваемого аргумента `epsilon`. Если передаваемое значение не является числовым, выдать исключение. Также следует выдать исключение, если передаваемое значение отрицательно или ноль."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Технические заметки:\n",
    "\n",
    "(1)\n",
    "При условии импортированной библиотеки `numpy` как это сделано в следующей ячейке, порождение новой реализации случайной действительной переменной, распределенной равномерно в из интервале $[0, 1]$, производится следующим образом:\n",
    "```\n",
    "new_x = np.random.rand()\n",
    "```\n",
    "\n",
    "(2)\n",
    "Рекомендую проверять точность оценки числа $\\pi$ не после каждой итерации (порождения новой точки), а, например, после каждой 100 итерации. Это позволит исключить остановку алгоритма в самом начале, когда несколько точек **подряд** случайно выпали внутри круга или вне круга. Например, это можно делать по условию, что накапливаемый атрибут $N$ делится нацело на 100. Остаток от деления нацело в python вычисляется следующим образом: `x % 100`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import numpy as np"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "class Approximator:\n",
    "    def __init__(self, epsilon):\n",
    "        self.eps = 0.0\n",
    "        self.N_in = None # You need to replace the value here\n",
    "        self.N = None # You need to replace the value here\n",
    "    \n",
    "    def approximate(self):\n",
    "        pi_previous = 10.0\n",
    "        pi_current = 10.0\n",
    "        \n",
    "        while True:\n",
    "            # YOUR CODE HERE\n",
    "            \n",
    "        \n",
    "        return pi_current"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "В следующей ячейке выполняются следующие действия:\n",
    "создается экземпляр класса `Approximator`\n",
    "вызывается метод `approximate` этого экземпляра, который должен выдать оценку числа $\\pi$"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "a = Approximator(epsilon=0.00001)\n",
    "pi_estimate = a.approximate()\n",
    "print(pi_estimate)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
